saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
        <!-- *************************  Device 'STM32L151RC'  ***************************** -->
        <device Dname="STM32L151RC">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h"  define="STM32L151xC"/>
          <debug svd="SVD/STM32L15xC.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_256.FLM"        start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x00002000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_256_OPT.FLM"    start="0x1FF80000" size="0x00000018"             default="0"/>

          <book name="Documents/DM00048356.pdf" title="STM32L15xCC STM32L15xRC STM32L15xUC STM32L15xVC Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="64"/>
          <feature type="CSP"           n="63"/>
        </device>

        <!-- *************************  Device 'STM32L151RD'  ***************************** -->
        <device Dname="STM32L151RD">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h"  define="STM32L151xD"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_384.FLM"        start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x00003000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_384_OPT.FLM"    start="0x1FF80000" size="0x00000020"             default="0"/>

          <book name="Documents/DM00034689.pdf" title="STM32L151xD STM32L152xD Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="3"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="QFP"           n="64"/>
          <feature type="CSP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L151UC'  ***************************** -->
        <device Dname="STM32L151UC">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xC"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_256.FLM"        start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x00002000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_256_OPT.FLM"    start="0x1FF80000" size="0x00000018"             default="0"/>

          <book name="Documents/DM00048356.pdf" title="STM32L15xCC STM32L15xRC STM32L15xUC STM32L15xVC Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="64"/>
          <feature type="CSP"           n="63"/>
        </device>

        <!-- *************************  Device 'STM32L151V8'  ***************************** -->
        <device Dname="STM32L151V8">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h"  define="STM32L151xB"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/CD00277537.pdf" title="STM32L151x6/8/B STM32L152x6/8/B Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="82"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="100"/>
          <feature type="BGA"           n="100"/>
        </device>

