saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="40"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="AnalogOther"   n="3"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="ExtBus"        n="1"/>
          <feature type="QFP"           n="144"/>
        </device>

        <!-- *************************  Device 'STM32L152QE'  ***************************** -->
        <device Dname="STM32L152QE">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L152xE"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_512.FLM"        start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x00004000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_512_OPT.FLM"    start="0x1FF80000" size="0x00000028"             default="0"/>

          <book name="Documents/DM00098321.pdf" title="STM32L151xE STM32L152xE Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="40"      m="12"/>
          <feature type="IOs"           n="109"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="BGA"           n="132"/>
        </device>

        <!-- *************************  Device 'STM32L152RE'  ***************************** -->
        <device Dname="STM32L152RE">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L152xE"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_512.FLM"        start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x00004000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_512_OPT.FLM"    start="0x1FF80000" size="0x00000028"             default="0"/>

          <book name="Documents/DM00098321.pdf" title="STM32L151xE STM32L152xE Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L152VE'  ***************************** -->
        <device Dname="STM32L152VE">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L152xE"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_512.FLM"        start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x00004000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_512_OPT.FLM"    start="0x1FF80000" size="0x00000028"             default="0"/>

          <book name="Documents/DM00098321.pdf" title="STM32L151xE STM32L152xE Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="25"      m="12"/>
          <feature type="IOs"           n="83"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="QFP"           n="100"/>
          <feature type="CSP"           n="104"/>
        </device>

        <!-- *************************  Device 'STM32L152ZE'  ***************************** -->
        <device Dname="STM32L152ZE">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L152xE"/>
          <debug svd="SVD/STM32L1xx.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_512.FLM"        start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x00004000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_512_OPT.FLM"    start="0x1FF80000" size="0x00000028"             default="0"/>
  
          <book name="Documents/DM00098321.pdf" title="STM32L151xE STM32L152xE Data Sheet"/>
  
