saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="40"      m="12"/>
          <feature type="IOs"           n="115"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="QFP"           n="144"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L162'  **************************** -->
      <subFamily DsubFamily="STM32L162">
        <book name="Documents/CD00240193.pdf" title="STM32L1xx Series Reference Manual"/>

        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="SPI"           n="3"       m="16000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32L162QD'  ***************************** -->
        <device Dname="STM32L162QD">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L162xD"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_384.FLM"        start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x00003000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_384_OPT.FLM"    start="0x1FF80000" size="0x00000020"             default="0"/>

          <book name="Documents/DM00039232.pdf" title="STM32L162VD, STM32L162ZD, STM32L162QD, STM32L162RD Data Sheet"/>

          <feature type="ADC"           n="39"      m="12"/>
          <feature type="IOs"           n="108"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="AnalogOther"   n="3"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="ExtBus"        n="1"/>
        </device>

        <!-- *************************  Device 'STM32L162RC'  ***************************** -->
        <device Dname="STM32L162RC">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L162xC"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_256.FLM"        start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x00002000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_256_OPT.FLM"    start="0x1FF80000" size="0x00000018"             default="0"/>

          <book name="Documents/DM00049732.pdf" title="STM32L162VC STM32L162RC Data Sheet"/>

          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L162RD'  ***************************** -->
        <device Dname="STM32L162RD">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L162xD"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00060000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x0000C000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_384.FLM"        start="0x08000000" size="0x00060000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_384_EEPROM.FLM" start="0x08080000" size="0x00003000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_384_OPT.FLM"    start="0x1FF80000" size="0x00000020"             default="0"/>

          <book name="Documents/DM00039232.pdf" title="STM32L162VD, STM32L162ZD, STM32L162QD, STM32L162RD Data Sheet"/>

          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="3"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="ExtBus"        n="1"/>
        </device>

        <!-- *************************  Device 'STM32L162RE'  ***************************** -->
        <device Dname="STM32L162RE">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L162xE"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00080000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00014000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_512.FLM"        start="0x08000000" size="0x00080000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_512_EEPROM.FLM" start="0x08080000" size="0x00003000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_512_OPT.FLM"    start="0x1FF80000" size="0x00000020"             default="0"/>

          <book name="Documents/DM00106442.pdf" title="STM32L162xE Data Sheet"/>

