saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
          <book name="Documents/DM00039232.pdf" title="STM32L162VD, STM32L162ZD, STM32L162QD, STM32L162RD Data Sheet"/>

          <feature type="ADC"           n="40"      m="12"/>
          <feature type="IOs"           n="114"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
          <feature type="AnalogOther"   n="3"/>
          <feature type="USART"         n="5"       m="4000000"/>
          <feature type="SDIO"          n="1"/>
          <feature type="ExtBus"        n="1"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L100xxA'  ************************* -->
      <subFamily DsubFamily="STM32L100xxA">
        <book name="Documents/CD00240193.pdf" title="STM32L1xx Series Reference Manual"/>

        <!-- *************************  Device 'STM32L100C6xxA'  ***************************** -->
        <device Dname="STM32L100C6xxA">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L100xBA"/>
          <debug svd="SVD/STM32L100.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00000800"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00108661.pdf" title="STM32L100x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="16"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.16"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="QFP"           n="48"/>
        </device>

        <!-- *************************  Device 'STM32L100R8xxA'  ***************************** -->
        <device Dname="STM32L100R8xxA">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L100xBA"/>
          <debug svd="SVD/STM32L100.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00000800"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>
  
          <book name="Documents/DM00108661.pdf" title="STM32L100x6/8/B-A Data Sheet"/>
  
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="QFP"           n="64"/>
        </device>

        <!-- *************************  Device 'STM32L100RBxxA'  ***************************** -->
        <device Dname="STM32L100RBxxA">
          <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L100xBA"/>
          <debug svd="SVD/STM32L100.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00002800" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00000800"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>
  
          <book name="Documents/DM00108661.pdf" title="STM32L100x6/8/B-A Data Sheet"/>
  
          <feature type="Timer"         n="6"       m="16"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="QFP"           n="64"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32L151xxA'  ************************* -->
      <subFamily DsubFamily="STM32L151xxA">
        <book name="Documents/CD00240193.pdf" title="STM32L1xx Series Reference Manual"/>

        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32L151C6xxA'  ***************************** -->
        <device Dname="STM32L151C6xxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>
        </device>

        <!-- *************************  Device 'STM32L151C8xxA'  ***************************** -->
        <device Dname="STM32L151C8xxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00010000"                  default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"              default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"                 default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>
        </device>

        <!-- *************************  Device 'STM32L151CBxxA'  ***************************** -->
        <device Dname="STM32L151CBxxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="14"      m="12"/>
          <feature type="IOs"           n="37"/>
          <feature type="LCD"           n="1"       m="4.18"/>
        </device>

