saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
        <!-- *************************  Device 'STM32L151R6xxA'  ***************************** -->
        <device Dname="STM32L151R6xxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00008000"                   default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"              default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"                 default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
        </device>

        <!-- *************************  Device 'STM32L151R8xxA'  ***************************** -->
        <device Dname="STM32L151R8xxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
        </device>

        <!-- *************************  Device 'STM32L151RBxxA'  ***************************** -->
        <device Dname="STM32L151RBxxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="20"      m="12"/>
          <feature type="IOs"           n="51"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
        </device>

        <!-- *************************  Device 'STM32L151RCxxA'  ***************************** -->
        <device Dname="STM32L151RCxxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xCA"/>
          <debug svd="SVD/STM32L15xC.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_256.FLM"        start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_256_EEPROM.FLM" start="0x08080000" size="0x00002000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_256_OPT.FLM"    start="0x1FF80000" size="0x00000018"             default="0"/>

          <book name="Documents/DM00111457.pdf" title="STM32L15xQC, STM32L15xRC-A, STM32L15xVC-A, STM32L15xZC Data Sheet"/>

          <feature type="Timer"         n="8"       m="16"/>
          <feature type="Timer"         n="1"       m="32"/>
          <feature type="ADC"           n="21"      m="12"/>
          <feature type="IOs"           n="50"/>
          <feature type="LCD"           n="1"       m="4.32"/>
          <feature type="LCD"           n="1"       m="8.28"/>
          <feature type="AnalogOther"   n="2"/>
          <feature type="SPI"           n="3"       m="16000000"/>
          <feature type="I2S"           n="2"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="QFP"           n="64"/>
          <feature type="CSP"           n="63"/>
        </device>

        <!-- *************************  Device 'STM32L151V8xxA'  ***************************** -->
        <device Dname="STM32L151V8xxA">
          <processor Dfpu="0" Dmpu="1" Dendian="Little-endian" Dclock="32000000"/>
          <compile header="Device/Include/stm32l1xx.h" define="STM32L151xBA"/>
          <debug svd="SVD/STM32L15xxxA.svd"/>
          <memory id="IROM1"                               start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                               start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="Flash/STM32L1xx_128.FLM"        start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="Flash/STM32L1xx_128_EEPROM.FLM" start="0x08080000" size="0x00001000"             default="0"/>
          <algorithm name="Flash/STM32L1xx_128_OPT.FLM"    start="0x1FF80000" size="0x00000010"             default="0"/>

          <book name="Documents/DM00078689.pdf" title="STM32L151x6/8/B-A, STM32L152x6/8/B-A Data Sheet"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="Timer"         n="2"       m="32"/>
          <feature type="SPI"           n="2"       m="16000000"/>
          <feature type="USART"         n="3"       m="4000000"/>
          <feature type="ADC"           n="24"      m="12"/>
          <feature type="IOs"           n="83"/>
          <feature type="LCD"           n="1"       m="4.44"/>
          <feature type="LCD"           n="1"       m="8.40"/>
        </device>

