saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
    <condition id="STM32L151xCA">
      <description>STMicroelectronics STM32L151xCA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151QC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151ZC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RCxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VCxxA"/>
    </condition>
    <condition id="STM32L151xD">
      <description>STMicroelectronics STM32L151xD devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151QD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151ZD"/>
    </condition>
    <condition id="STM32L151xE">
      <description>STMicroelectronics STM32L151xE devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151QE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151RE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151VE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L151ZE"/>
    </condition>
    <condition id="STM32L152xB">
      <description>STMicroelectronics STM32L152xB devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152CB"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R6"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RB"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152V8"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VB"/>
    </condition>
    <condition id="STM32L152xBA">
      <description>STMicroelectronics STM32L152xBA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152C8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152CBxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R6xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152R8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RBxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152V8xxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VBxxA"/>
    </condition>
    <condition id="STM32L152xC">
      <description>STMicroelectronics STM32L152xC devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152CC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VC"/>
    </condition>
    <condition id="STM32L152xCA">
      <description>STMicroelectronics STM32L152xCA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152QC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152ZC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RCxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VCxxA"/>
    </condition>
    <condition id="STM32L152xD">
      <description>STMicroelectronics STM32L152xD devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152QD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152ZD"/>
    </condition>
    <condition id="STM32L152xE">
      <description>STMicroelectronics STM32L152xE devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152QE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152RE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152VE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L152ZE"/>
    </condition>
    <condition id="STM32L162xC">
      <description>STMicroelectronics STM32L162xC devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162RC"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162VC"/>
    </condition>
    <condition id="STM32L162xCA">
      <description>STMicroelectronics STM32L162xCA devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162RCxxA"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162VCxxA"/>
    </condition>
    <condition id="STM32L162xD">
      <description>STMicroelectronics STM32L162xD devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162QD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162RD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162VD"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162ZD"/>
    </condition>
    <condition id="STM32L162xE">
      <description>STMicroelectronics STM32L162xE devices</description>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162RE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162VE"/>
      <accept Dvendor="STMicroelectronics:13" Dname="STM32L162ZE"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32L100xB CMSIS">
      <description>STMicroelectronics STM32L100xB devices and CMSIS-Core</description>
      <require condition="STM32L100xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L100xBA CMSIS">
      <description>STMicroelectronics STM32L100xBA devices and CMSIS-Core</description>
      <require condition="STM32L100xBA"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L100xC CMSIS">
      <description>STMicroelectronics STM32L100xC devices and CMSIS-Core</description>
      <require condition="STM32L100xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L151xB CMSIS">
      <description>STMicroelectronics STM32L151xB devices and CMSIS-Core</description>
      <require condition="STM32L151xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L151xBA CMSIS">
      <description>STMicroelectronics STM32L151xBA devices and CMSIS-Core</description>
      <require condition="STM32L151xBA"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L151xC CMSIS">
      <description>STMicroelectronics STM32L151xC devices and CMSIS-Core</description>
      <require condition="STM32L151xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32L151xCA CMSIS">
      <description>STMicroelectronics STM32L151xCA devices and CMSIS-Core</description>
      <require condition="STM32L151xCA"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
