saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.STM32L1xx_DFP.1.2.0.pdsc
    <!-- Startup STM32L152xB -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L152xB CMSIS">
      <description>System Startup for STMicroelectronics STM32L152xB Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l152xb.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L152xBA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L152xBA CMSIS">
      <description>System Startup for STMicroelectronics STM32L152xBA Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l152xba.s"  attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L152xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L152xC CMSIS">
      <description>System Startup for STMicroelectronics STM32L152xC Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l152xc.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L152xCA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L152xCA CMSIS">
      <description>System Startup for STMicroelectronics STM32L152xCA Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l152xca.s"  attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L152xD -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L152xD CMSIS">
      <description>System Startup for STMicroelectronics STM32L152xD Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l152xd.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_HD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L152xE -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L152xE CMSIS">
      <description>System Startup for STMicroelectronics STM32L152xE Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l152xe.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_XL_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L162xC -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L162xC CMSIS">
      <description>System Startup for STMicroelectronics STM32L162xC Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l162xc.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L162xCA -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L162xCA CMSIS">
      <description>System Startup for STMicroelectronics STM32L162xCA Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l162xca.s"  attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_MD+_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L162xD -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L162xD CMSIS">
      <description>System Startup for STMicroelectronics STM32L162xD Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l162xd.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_HD_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- Startup STM32L162xE -->
    <component Cclass="Device" Cgroup="Startup" Cversion="2.0.0" condition="STM32L162xE CMSIS">
      <description>System Startup for STMicroelectronics STM32L162xE Devices</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/system_stm32l1xx.c"          attr="config"    version="2.0.0"/>
        <file category="source"  name="Device/Source/ARM/startup_stm32l162xe.s"   attr="config"    version="2.0.0" condition="Compiler ARMCC"/>
        <file category="source"  name="Device/Source/ARM/STM32L1xx_XL_OPT.s"      attr="template"  version="1.0.0" condition="Compiler ARMCC" select="Flash Option Bytes Template"/>
      </files>
    </component>

    <!-- STM32L-Discovery Board Support -->
    <bundle Cbundle="STM32L-Discovery" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32L-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.00" condition="STM32L152xB CMSIS">
      <description>LED driver for STMicroelectronics STM32L-Discovery Board</description>
        <files>
          <file category="source" name="Boards/ST/STM32L-Discovery/Common/LED_STM32L-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.00" condition="STM32L152xB CMSIS">
      <description>Button driver for STMicroelectronics STM32L-Discovery Board</description>
        <files>
        <file category="sourceC" name="Boards/ST/STM32L-Discovery/Common/Buttons_STM32L-Discovery.c"/>
        </files>
      </component>
    </bundle>
  </components>

